Revit 2027 API
StructuralConnectionHandler.Create Method
Overload List
Name | Description
Create(Document, IList<ElementId>, ElementId) |  Creates a new instance of a Structural Connection Handler, which defines the connection between given elements.
Create(Document, IList<ElementId>, String) |  Creates custom StructuralConnectionHandlerType and StructuralConnectionHandler.
Create(Document, IList<ElementId>, ElementId, IList<ConnectionInputPoint>) |  Creates a new instance of a Structural Connection Handler, which is defined by the elements to connect and the additional points.
Top
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace